# CannotPasteLabelsAcrossFamilies Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..CannotPasteLabelsAcrossFamilies Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Can't paste Labels across Families of different Categories.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotPasteLabelsAcrossFamilies { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotPasteLabelsAcrossFamilies As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotPasteLabelsAcrossFamilies {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace